tap "azure/functions"
tap "bloznelis/tap"
tap "codecrafters-io/tap"
tap "michaeleisel/zld"
tap "nikitabobko/tap"

brew "azure/functions/azure-functions-core-tools@4"
brew "bloznelis/tap/kbt"
brew "codecrafters-io/tap/codecrafters"

brew "act"
brew "aichat"
brew "xz"
brew "apr-util"
brew "python@3.13"
brew "automake"
brew "bash"
brew "glib"
brew "cairo"
brew "capnp"
brew "carapace"
brew "ccache"
brew "cloudflared"
brew "cloc"
brew "unbound"
brew "harfbuzz"
brew "python@3.12"
brew "tesseract"
brew "fnm"
brew "git-filter-repo"
brew "helix"
brew "node"
brew "node@20"
brew "mint"
brew "socat"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "poppler"
brew "zf"
brew "yarn"

tap "dimentium/autoraise"
tap "felixkratz/formulae"
tap "jackielii/tap"
tap "knqyf263/pet"
tap "koekeishiya/formulae"
tap "mhaeuser/mhaeuser"
tap "oven-sh/bun"
tap "sst/tap"

brew "ast-grep"
brew "azure-cli"
brew "bat"
brew "btop"
brew "chezmoi"
brew "clipboard"
brew "cmake"
brew "ripgrep"
brew "codex"
brew "coreutils"
brew "diff-so-fancy"
brew "difftastic"
brew "dotnet"
brew "dust"
brew "libgit2"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fish"
brew "fzf"

brew "gawk"
brew "gh"
brew "git-delta"
brew "git-quick-stats"
brew "git-who"
brew "gitleaks"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gperf"
brew "gpgme"
brew "jj"
brew "jjui"
brew "jless"
brew "jq"
brew "just"
brew "lazygit"
brew "libmagic"
brew "libpq", link: true
brew "lnav"
brew "luarocks"
brew "mas"
brew "mise"
brew "utf8proc"
brew "neovim"
brew "ninja"
brew "nushell"
brew "openssl@1.1"
brew "pam-reattach"
brew "pandoc"
brew "pkgconf"
brew "pnpm", link: false
brew "protobuf"
brew "qemu"
brew "rsync"
brew "rust"
brew "rust-analyzer"
brew "showkey"
brew "starship"
brew "stow"
brew "subversion"
brew "switchaudio-osx"
brew "tmux", args: ["HEAD"]
brew "tokei"
brew "topiary"
brew "tree"
brew "unar"
brew "uv"
brew "vim"
brew "vivid"
brew "wget"
brew "yazi"
brew "zellij"
brew "zoxide"

brew "dimentium/autoraise/autoraise", args: ["with-dalternative_task_switcher", "with-dexperimental_focus_first"]
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "jackielii/tap/skhd-zig"
brew "knqyf263/pet/pet"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"

cask "1password-cli"
cask "aerospace"
cask "alt-tab"
cask "anybar"
cask "battery-toolkit"
cask "chromium"
cask "font-fira-code"
cask "font-monaspace"
cask "font-source-code-pro"
cask "homerow"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kitty"
cask "libreoffice"
cask "neovide-app"
cask "warp"
cask "wezterm"
cask "wireshark-app"
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "ashinzekene.nestjs"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "effectful-tech.effect-vscode"
vscode "eg2.tslint"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "leetcode.vscode-leetcode"
vscode "letmaik.git-tree-compare"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qinjia.seti-icons"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "shan.code-settings-sync"
vscode "typescriptteam.native-preview"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
